# GetModifiedElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentChangedEventArgs..::..GetModifiedElementIds Method
DocumentChangedEventArgs Class See Also
---
Returns set of elements that were modified.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetModifiedElementIds()
```

Visual Basic
---
```text
Public Function GetModifiedElementIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetModifiedElementIds()
```

# ### Return Value
The set of ElementId for elements that were modified.
# See Also
DocumentChangedEventArgs Class
GetModifiedElementIds Overload
Autodesk.Revit.DB.Events Namespace